In [1]:
import pandas as pd

In [4]:
df = pd.read_csv('demo_data2.csv')
df

    A   B   C
0  30  21   9
1  35  34   1
2  41  11  11

In [5]:
# native accessor 
df.A # a Series

0    30
1    35
2    41
Name: A, dtype: int64

In [6]:
df['A'][0]

30

In [8]:
# index based selection
df.iloc[0] # gives first row

A    30
B    21
C     9
Name: 0, dtype: int64

In [9]:
df.loc[0] # same as iloc

A    30
B    21
C     9
Name: 0, dtype: int64

In [14]:
df.iloc[0][1] # (first row, second column) [unlike python array where this indexing
            # will mean (first col, second row) ]

21

In [19]:
df.iloc[::-1] # array tricks

    A   B   C
2  41  11  11
1  35  34   1
0  30  21   9

In [22]:
df.iloc[::-1, 1] # array tricks for only column 1

2    11
1    34
0    21
Name: B, dtype: int64

In [29]:
# level based selection
df.loc[1, 'A'] # only works with loc, not iloc

35

In [30]:
df.loc[1, ['A', 'B']]

A    35
B    34
Name: 1, dtype: int64

In [31]:
# difference between loc and iloc
# df.iloc[0, 3] will give [0, 1, 2]
# df.loc[0, 3] will give [0, 1, 2, 3]

In [33]:
# manipulating index
df.set_index('A') # thanks for fucking up my dset

     B   C
A
30  21   9
35  34   1
41  11  11

In [34]:
df = pd.read_csv('demo_data2.csv')

In [36]:
# conditional searching
df.A == 30

0     True
1    False
2    False
Name: A, dtype: bool

In [44]:
df.loc[df.A == 30]

    A   B  C
0  30  21  9

In [49]:
df.loc[(df.A == 30) | (df.A >= 40)] # use & or | (bitwise signs)

    A   B   C
0  30  21   9
2  41  11  11

In [50]:
df.loc[df.A.isin([30, 41])]

    A   B   C
0  30  21   9
2  41  11  11

In [60]:
df.C = range(len(df), 0, -1) # assign a constant or an iterable
df

    A   B  C
0  30  21  3
1  35  34  2
2  41  11  1